#include "Library.h"
#include "MenuLibrary.h"
#include <iostream>
using namespace std;

int main() {
    const int SIZE = 10;
    Book books[SIZE] = {
        {"Війна і мир", "Лев Толстой", "АСТ", "Роман"},
        {"Гаррі Поттер", "Дж.К. Роулінг", "Видавництво А-БА-БА-ГА-ЛА-МА-ГА", "Фентезі"},
        {"1984", "Джордж Орвелл", "Книжковий Клуб", "Антиутопія"},
        {"Майстер і Маргарита", "Михайло Булгаков", "Азбука", "Роман"},
        {"Пригоди Шерлока Холмса", "Артур Конан Дойл", "Астролябія", "Детектив"},
        {"Ідіот", "Федір Достоєвський", "Фоліо", "Роман"},
        {"Пісня льоду і полум'я", "Джордж Мартін", "Імпульс", "Фентезі"},
        {"Тіні забутих предків", "Михайло Коцюбинський", "Веселка", "Повість"},
        {"Злочин і кара", "Федір Достоєвський", "А-БА-БА-ГА-ЛА-МА-ГА", "Роман"},
        {"Віднесені вітром", "Маргарет Мітчелл", "Видавництво Старого Лева", "Роман"}
    };

    int choice;
    do {
        showMenu();
        choice = getChoice();
        handleChoice(choice, books, SIZE);
    } while (choice != 0);

    return 0;
}